<?php
//Данный числовой ряд - это последовательность Фибоначчи
function sequence($a, $b, $x) {
	if ($a > $x) {
		echo "Задуманное число НЕ входит в числовой ряд";
	} elseif ($a == $x) {
		echo "Задуманное число входит в числовой ряд";
	} else {
		$c = $a;      //1 //2 //3 //5 //8 //
		$a = $a + $b; //2 //3 //5 //8 //13
		$b = $c;      //1 //2 //3 //5 //8
		sequence($a, $b, $x);
	}
}
$x = $_GET['x'];
echo "Число ".$x.'<br>';
$a = 1;
$b = 1; 
sequence($a, $b, $x); //1,1,7 // 2,1,7 // 3,2,7 //5,3,7 //8,5,7 //13,8,7 //21, ...
?>